html/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-09 Wed 04:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SYSC3010 Group Project</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href=style.css />
</head>
<body>
<div id="content">
<h1 class="title">SYSC3010 Group Project</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6a227ad">1. Links</a></li>
<li><a href="#org9194aa9">2. Project Description</a></li>
<li><a href="#orga7ad4de">3. Repository Roadmap</a></li>
<li><a href="#org2043baa">4. How to run the code</a>
<ul>
<li><a href="#org5b626b3">4.1. Dependencies</a></li>
<li><a href="#org95d8a26">4.2. Control Server</a></li>
<li><a href="#org4503f53">4.3. Door Node</a></li>
</ul>
</li>
<li><a href="#org0eaadf7">5. Group Contributions</a>
<ul>
<li><a href="#orga65fdb7">5.1. Sam</a></li>
<li><a href="#org842b57c">5.2. Sunny</a></li>
<li><a href="#orgd0c29dd">5.3. Mario</a></li>
<li><a href="#org393a236">5.4. Morgan</a></li>
</ul>
</li>
<li><a href="#org7a214b0">6. Style Guide</a>
<ul>
<li><a href="#org7e23fcf">6.1. Terminology</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6a227ad" class="outline-2">
<h2 id="org6a227ad"><span class="section-number-2">1</span> Links</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://morgansmith.xyz/stats.html">Git Contribution Stats</a></li>
<li><a href="meeting-notes.html">Meeting Notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9194aa9" class="outline-2">
<h2 id="org9194aa9"><span class="section-number-2">2</span> Project Description</h2>
<div class="outline-text-2" id="text-2">
<p>
The purpose of this system is to increase security and safety of
secured locations, like offices. The system will attempt to prevent
the spread of illness by limiting the number of people which can enter
the building, and by preventing people with a high body temperature
from entering the building.
</p>

<p>
This system will be mounted on the entrances and exits of a
building. The system will be modular to allow an arbitrary number of
nodes to be added.
</p>

<p>
The system will display a green light at the entrance if it is
accepting people. The light will turn red when the area is closed or
if there are too many people inside.
</p>

<p>
If the light is green, the user will present their NFC security card to the
system. The system send a message containing a unique user ID to a server. The
server will use it'd database to determine if the user is authorized. The
server will then notify the door with the results of the query.  If the user
has not already been denied, the system will then take the user's temperature
and send the result to the server. If the temperature is below the set
threshold, and they have access, the server will allow the door to open.
</p>

<p>
Every access attempt, including the associated temperature reading and
user ID, is sent to the server to be logged in a database.
</p>

<p>
Users will also have to present their NFC card to the door to leave
the building. By tracking users entering and exiting the building, the
server will know how many people are in the building.
</p>

<p>
The central server also provides a GUI available to the building's security
team.
</p>
</div>
</div>

<div id="outline-container-orga7ad4de" class="outline-2">
<h2 id="orga7ad4de"><span class="section-number-2">3</span> Repository Roadmap</h2>
<div class="outline-text-2" id="text-3">
<p>
This repository contains all of the files related to our project. Our proposal,
design document and final report are located in the proposal, design and
final-report folders respectively. All of our source code is located in the
src folder.
</p>

<p>
Within the src folder, several top level programs are located such as
door<sub>node</sub><sub>controller.py</sub> and control<sub>server.py</sub>. Aditional scripts are located in
subfolders of the src folder such as hardware drivers in the hardware folder,
GUI related code in the gui folder, ThingSpeak and messages parsing related code
in the communication folder and hardware stubs in the stub folder.
</p>

<p>
The test subfolder of the src directory of our repository contains all of our
test code for our end to end and testing demos.
</p>
</div>
</div>

<div id="outline-container-org2043baa" class="outline-2">
<h2 id="org2043baa"><span class="section-number-2">4</span> How to run the code</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5b626b3" class="outline-3">
<h3 id="org5b626b3"><span class="section-number-3">4.1</span> Dependencies</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The following dependancies are required to run the door node software with
hardware emulating stubs, the control server and the GUI server.
</p>

<ul class="org-ul">
<li>python &gt;= 3.7</li>
<li>python-requests</li>
<li>python-flask</li>
<li>python-flask-socketio</li>
<li>python-gevent</li>
<li>python-socketio</li>
</ul>

<p>
In order to run the door node software with hardware present, the following
additional Python packages are required:
</p>

<ul class="org-ul">
<li>rpi.gpio</li>
<li>mfrc522</li>
<li>adafruit-circuitpython-vl53l0x</li>
<li>smbus</li>
</ul>
</div>
</div>

<div id="outline-container-org95d8a26" class="outline-3">
<h3 id="org95d8a26"><span class="section-number-3">4.2</span> Control Server</h3>
<div class="outline-text-3" id="text-4-2">
<p>
You will need to run two separate processes.
</p>

<p>
The first is the Control Server which is responsible for the control logic.
</p>

<div class="org-src-container">
<pre class="src src-sh">cd src
./control_server.py
</pre>
</div>

<p>
The second is the GUI which can be used to view and modify the settings of the
Control Server. It can also be used to view access logs.
</p>

<div class="org-src-container">
<pre class="src src-sh">cd src
./gui/run_gui.py
</pre>
</div>
</div>
</div>
<div id="outline-container-org4503f53" class="outline-3">
<h3 id="org4503f53"><span class="section-number-3">4.3</span> Door Node</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-sh">cd src
./door_node_controller.py
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0eaadf7" class="outline-2">
<h2 id="org0eaadf7"><span class="section-number-2">5</span> Group Contributions</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orga65fdb7" class="outline-3">
<h3 id="orga65fdb7"><span class="section-number-3">5.1</span> Sam</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Submit deliverables</li>
</ul>
</div>
</div>
<div id="outline-container-org842b57c" class="outline-3">
<h3 id="org842b57c"><span class="section-number-3">5.2</span> Sunny</h3>
</div>
<div id="outline-container-orgd0c29dd" class="outline-3">
<h3 id="orgd0c29dd"><span class="section-number-3">5.3</span> Mario</h3>
</div>
<div id="outline-container-org393a236" class="outline-3">
<h3 id="org393a236"><span class="section-number-3">5.4</span> Morgan</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>Meeting Secretary</li>
<li>Server hosting
<ul class="org-ul">
<li>Created and hosted HTML pages to aid in demos</li>
<li>Hosted the control server so the GUI could be accessible by anyone</li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org5c3ae59"></a>Code Contributions<br />
<div class="outline-text-4" id="text-5-4-1">
<ul class="org-ul">
<li>Control Server control flow</li>
<li>Control Server &amp; Door Node testing and debugging</li>
<li>Control Server unit</li>
<li>Door Actuator hardware code</li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org7a214b0" class="outline-2">
<h2 id="org7a214b0"><span class="section-number-2">6</span> Style Guide</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org7e23fcf" class="outline-3">
<h3 id="org7e23fcf"><span class="section-number-3">6.1</span> Terminology</h3>
<div class="outline-text-3" id="text-6-1">
<p>
To keep a consistent style please use the following terms. No synonyms please
</p>
<ul class="org-ul">
<li>Door Node</li>
<li>Control Server
<ul class="org-ul">
<li>Users have: Accounts</li>
</ul></li>
<li>Security Badge</li>
<li>NFC security badge reader</li>
<li>infrared temperature sensor</li>
<li>electronic lock actuator</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
